{
  "Z_forward": "exact installed Diffusers pipeline body with 8-bit STE forward values",
  "all_cases": false,
  "arcface": {
    "arcface_architecture": "iresnet100",
    "arcface_channel_order": "rgb",
    "arcface_checkpoint_filename": "iresnet100.pth",
    "arcface_checkpoint_path": "/home/interns/Desktop/face4/models/arcface/iresnet100.pth",
    "arcface_checkpoint_sha256": "a566a62357f0c55b679d9ff2f022a294486568be0c00665d39029d0e46a8109b",
    "arcface_checkpoint_source": "user_provided_local_checkpoint",
    "arcface_embedding_dimension": 512,
    "arcface_embedding_normalization": "l2",
    "arcface_input_size": 112,
    "arcface_normalization": "minus_one_to_one",
    "architecture": "iresnet100",
    "exact_state_dict_match": true,
    "loaded_state_entries": 925,
    "missing_state_entries": [],
    "parameter_count": 65156160,
    "shape_mismatches": {},
    "state_dict_match_ratio": 1.0,
    "trainable_parameter_count": 0,
    "unexpected_state_entries": []
  },
  "arcface_checkpoint": "/home/interns/Desktop/face4/models/arcface/iresnet100.pth",
  "backward_scale": 65536.0,
  "backward_scale_backoff": 0.5,
  "backward_scale_max_retries": 20,
  "backward_scale_min": 1.0,
  "checkpoint_every": 25,
  "differentiable_instructpix2pix": {
    "differentiable_editor": true,
    "dtype": "float16",
    "editor": "timbrooks/instruct-pix2pix",
    "implementation": "inspect.unwrap(installed Diffusers pipeline __call__)",
    "package_versions": {
      "accelerate": "1.14.0",
      "cudnn": 90100,
      "diffusers": "0.38.0",
      "torch": "2.5.1+cu121",
      "torch_cuda": "12.1",
      "transformers": "5.12.1"
    },
    "reconstructed_denoising_loop": false,
    "scheduler_class": "EulerAncestralDiscreteScheduler",
    "scheduler_config": {
      "_class_name": "EulerAncestralDiscreteScheduler",
      "_diffusers_version": "0.12.0.dev0",
      "_use_default_values": [
        "timestep_spacing",
        "rescale_betas_zero_snr"
      ],
      "algorithm_type": "dpmsolver++",
      "beta_end": 0.012,
      "beta_schedule": "scaled_linear",
      "beta_start": 0.00085,
      "clip_sample": false,
      "dynamic_thresholding_ratio": 0.995,
      "lower_order_final": true,
      "num_train_timesteps": 1000,
      "prediction_type": "epsilon",
      "rescale_betas_zero_snr": false,
      "sample_max_value": 1.0,
      "set_alpha_to_one": false,
      "skip_prk_steps": true,
      "solver_order": 2,
      "solver_type": "midpoint",
      "steps_offset": 1,
      "thresholding": false,
      "timestep_spacing": "linspace",
      "trained_betas": null
    },
    "settings": {
      "enable_gradient_checkpointing": true,
      "enable_vae_slicing": true,
      "eta": 0.0,
      "guidance_scale": 7.5,
      "image_guidance_scale": 1.5,
      "model_id": "timbrooks/instruct-pix2pix",
      "num_inference_steps": 20,
      "quantize_input_8bit": true,
      "quantize_output_8bit": true,
      "torch_dtype": "float16"
    },
    "stock_pipeline_math_used_for_gradient": true,
    "vae_scale_factor": 8
  },
  "edit_eta": 0.0,
  "edit_steps": 20,
  "editor_dtype": "float16",
  "editor_model_id": "timbrooks/instruct-pix2pix",
  "enable_editor_gradient_checkpointing": true,
  "force": false,
  "geometry_config_path": "configs/geometry_extended_all.json",
  "geometry_config_resolved": {
    "bspline_enabled": true,
    "bspline_norm_limit": 0.02,
    "bspline_px_limit": null,
    "bspline_size": 6,
    "dct_block_size": 8,
    "dct_enabled": false,
    "dct_exclude_dc": true,
    "dct_frequency_mask": "all_ac",
    "dct_gain_limit": 0.5,
    "delaunay_enabled": true,
    "delaunay_norm_limit": 0.015,
    "delaunay_px_limit": null,
    "delaunay_size": 5,
    "differential_surface_enabled": true,
    "differential_surface_height_limit": 0.04,
    "differential_surface_px_scale": 12.0,
    "differential_surface_size": 7,
    "edge_falloff_px": 16.0,
    "fft_phase_enabled": false,
    "fft_phase_limit_rad": 3.141592653589793,
    "fft_phase_size": 8,
    "geodesic_enabled": true,
    "geodesic_norm_limit": 0.03,
    "geodesic_px_limit": null,
    "init": "small_random",
    "init_fraction": 0.05,
    "laplacian_enabled": true,
    "laplacian_norm_limit": 0.02,
    "laplacian_px_limit": null,
    "laplacian_size": 7,
    "laplacian_smoothing_alpha": 0.35,
    "laplacian_smoothing_steps": 8,
    "lens_barrel_enabled": true,
    "lens_barrel_k_limit": 0.35,
    "lens_k_limit": 0.35,
    "lens_pincushion_enabled": true,
    "lens_pincushion_k_limit": 0.35,
    "max_combined_disp_px": null,
    "mobius_enabled": true,
    "mobius_limit": 0.2,
    "polar_enabled": true,
    "polar_radial_norm_limit": 0.02,
    "polar_radial_px_limit": null,
    "polar_twist_limit_rad": 0.35,
    "rolling_enabled": true,
    "rolling_norm_limit": 0.01,
    "rolling_px_limit": null,
    "spatial_padding_mode": "border",
    "tps_enabled": true,
    "tps_norm_limit": 0.008,
    "tps_px_limit": null,
    "tps_size": 5
  },
  "geometry_limits": {
    "bspline_enabled": true,
    "bspline_limit_px": 10.24,
    "bspline_norm_limit": 0.02,
    "dct_block_size": 8,
    "dct_enabled": false,
    "dct_exclude_dc": true,
    "dct_frequency_mask": "all_ac",
    "dct_gain_limit": 0.5,
    "dct_mode": "block_frequency_gain",
    "dct_selected_frequency_count": 189,
    "delaunay_enabled": true,
    "delaunay_limit_px": 7.68,
    "delaunay_norm_limit": 0.015,
    "differential_surface_enabled": true,
    "differential_surface_height_limit": 0.04,
    "differential_surface_px_scale": 12.0,
    "fft_phase_enabled": false,
    "fft_phase_limit_rad": 3.141592653589793,
    "geodesic_enabled": true,
    "geodesic_limit_px": 15.36,
    "geodesic_norm_limit": 0.03,
    "laplacian_enabled": true,
    "laplacian_limit_px": 10.24,
    "laplacian_norm_limit": 0.02,
    "lens_barrel_enabled": true,
    "lens_barrel_k_limit": 0.35,
    "lens_k_limit": 0.35,
    "lens_pincushion_enabled": true,
    "lens_pincushion_k_limit": 0.35,
    "max_combined_disp_px": null,
    "mobius_enabled": true,
    "mobius_limit": 0.2,
    "polar_enabled": true,
    "polar_radial_limit_px": 10.24,
    "polar_radial_norm_limit": 0.02,
    "polar_twist_limit_rad": 0.35,
    "rolling_enabled": true,
    "rolling_limit_px": 5.12,
    "rolling_norm_limit": 0.01,
    "spatial_padding_mode": "border",
    "tps_enabled": true,
    "tps_limit_px": 4.096,
    "tps_norm_limit": 0.008
  },
  "guidance_scale": 7.5,
  "image_guidance_scale": 1.5,
  "init": "small_random",
  "iters": 2,
  "loss": "loss = Z",
  "lr": 0.05,
  "mat_root": "/home/interns/Desktop/mat",
  "mode": "smoke_timing",
  "model_weights_frozen": true,
  "no_visual_counter_loss": true,
  "objective": "Z = cosine_similarity(ArcFace(exact clean edit), ArcFace(exact perturbed edit))",
  "output_root": "outputs/smoke_timing",
  "parity_exact_max_Z_gap": 1e-06,
  "parity_exact_max_abs": 0.0039225686274509805,
  "parity_exact_min_ssim": 0.999,
  "parity_max_Z_gap": null,
  "parity_native_pil_max_Z_gap": 0.005,
  "parity_native_pil_min_ssim": 0.99,
  "parity_preflight": {
    "Z_grad": 0.7888458371162415,
    "Z_no_grad": 0.7888458371162415,
    "Z_stock_native_pil": 0.7881941795349121,
    "Z_stock_tensor": 0.7888458371162415,
    "backward_scale": 65536.0,
    "checks": {
      "Z_parity": true,
      "exact_tensor_Z_parity": true,
      "finite_nonzero_input_gradient": true,
      "grad_no_grad_exact_forward_parity": true,
      "grad_stock_tensor_exact_forward_parity": true,
      "native_pil_Z_parity": true,
      "stock_tensor_native_pil_parity": true
    },
    "exact_tensor_max_Z_gap": 0.0,
    "input_gradient_finite": true,
    "input_gradient_norm": 0.09812058508396149,
    "max_Z_gap": 0.0006516575813293457,
    "native_pil_Z_gap": 0.0006516575813293457,
    "pairs": {
      "grad_vs_no_grad": {
        "l2": 0.0,
        "max_abs": 0.0,
        "mean_abs": 0.0,
        "mse": 0.0,
        "psnr": 100.0,
        "ssim": 1.0,
        "tensor_max_abs": 0.0,
        "tensor_mean_abs": 0.0
      },
      "grad_vs_stock_tensor": {
        "l2": 0.0,
        "max_abs": 0.0,
        "mean_abs": 0.0,
        "mse": 0.0,
        "psnr": 100.0,
        "ssim": 1.0,
        "tensor_max_abs": 0.0,
        "tensor_mean_abs": 0.0
      },
      "stock_tensor_vs_native_pil": {
        "l2": 0.001091230715152609,
        "max_abs": 0.01176472008228302,
        "mean_abs": 0.00030150567181408405,
        "mse": 1.1907844736924744e-06,
        "psnr": 59.241668366333435,
        "ssim": 0.9995965957641602,
        "tensor_max_abs": 0.011764705181121826,
        "tensor_mean_abs": 0.00030152578256092966
      }
    },
    "passed": true,
    "prompt": "add black sunglasses",
    "resolved_native_pil_max_Z_gap": 0.005,
    "seed": 250852,
    "thresholds": {
      "exact_max_Z_gap": 1e-06,
      "exact_max_abs": 0.0039225686274509805,
      "exact_min_ssim": 0.999,
      "max_Z_gap": null,
      "native_pil_max_Z_gap": 0.005,
      "native_pil_min_ssim": 0.99
    }
  },
  "parity_threshold_semantics": {
    "exact_tensor_Z_gap": 1e-06,
    "native_pil_public_replay_Z_gap": 0.005
  },
  "quantize_input_8bit": true,
  "quantize_output_8bit": true,
  "quick": true,
  "require_parity_preflight": true,
  "resume_latest": false,
  "resume_run_root": null,
  "seed": null,
  "skip_deepface": true,
  "source_url": null,
  "spec": {
    "case_id": "face_002__add_black_sunglasses",
    "experiment": "edited_output_identity_exact",
    "face_id": "face_002",
    "image_path": "/home/interns/Desktop/mat/data/face_002/instruct_512.png",
    "model": "instructpix2pix_arcface_iresnet100",
    "prompt": "add black sunglasses",
    "seed": 250852
  },
  "stock_validation_every": 1
}
